{
    "Unnamed: 0":{
        "0":0,
        "1":1,
        "2":2,
        "3":3,
        "4":4,
        "5":5,
        "6":6,
        "7":7,
        "8":8,
        "9":9,
        "10":10,
        "11":11,
        "12":12,
        "13":13,
        "14":14,
        "15":15,
        "16":16,
        "17":17,
        "18":18,
        "19":19,
        "20":20,
        "21":21,
        "22":22,
        "23":23,
        "24":24,
        "25":25,
        "26":26,
        "27":27,
        "28":28,
        "29":29,
        "30":30,
        "31":31,
        "32":32,
        "33":33,
        "34":34,
        "35":35,
        "36":36,
        "37":37,
        "38":38,
        "39":39,
        "40":40,
        "41":41,
        "42":42,
        "43":43,
        "44":44,
        "45":45,
        "46":46,
        "47":47,
        "48":48,
        "49":49,
        "50":50,
        "51":51,
        "52":52,
        "53":53,
        "54":54,
        "55":55,
        "56":56,
        "57":57,
        "58":58,
        "59":59,
        "60":60,
        "61":61,
        "62":62,
        "63":63,
        "64":64,
        "65":65,
        "66":66,
        "67":67,
        "68":68,
        "69":69,
        "70":70,
        "71":71,
        "72":72,
        "73":73,
        "74":74,
        "75":75,
        "76":76,
        "77":77,
        "78":78,
        "79":79,
        "80":80,
        "81":81,
        "82":82,
        "83":83,
        "84":84,
        "85":85,
        "86":86,
        "87":87,
        "88":88,
        "89":89,
        "90":90,
        "91":91,
        "92":92,
        "93":93,
        "94":94,
        "95":95,
        "96":96,
        "97":97,
        "98":98,
        "99":99,
        "100":100,
        "101":101,
        "102":102,
        "103":103,
        "104":104,
        "105":105,
        "106":106,
        "107":107,
        "108":108,
        "109":109,
        "110":110,
        "111":111,
        "112":112,
        "113":113,
        "114":114,
        "115":115,
        "116":116,
        "117":117,
        "118":118,
        "119":119,
        "120":120,
        "121":121,
        "122":122,
        "123":123,
        "124":124,
        "125":125,
        "126":126,
        "127":127,
        "128":128
    },
    "Unnamed: 0.1":{
        "0":0,
        "1":1,
        "2":2,
        "3":3,
        "4":4,
        "5":5,
        "6":6,
        "7":7,
        "8":8,
        "9":9,
        "10":10,
        "11":11,
        "12":12,
        "13":13,
        "14":14,
        "15":15,
        "16":16,
        "17":17,
        "18":18,
        "19":19,
        "20":20,
        "21":21,
        "22":22,
        "23":23,
        "24":24,
        "25":25,
        "26":26,
        "27":27,
        "28":28,
        "29":29,
        "30":30,
        "31":31,
        "32":32,
        "33":33,
        "34":34,
        "35":35,
        "36":36,
        "37":37,
        "38":38,
        "39":39,
        "40":40,
        "41":41,
        "42":42,
        "43":43,
        "44":44,
        "45":45,
        "46":46,
        "47":47,
        "48":48,
        "49":49,
        "50":50,
        "51":51,
        "52":52,
        "53":53,
        "54":54,
        "55":55,
        "56":56,
        "57":57,
        "58":58,
        "59":59,
        "60":60,
        "61":61,
        "62":62,
        "63":63,
        "64":64,
        "65":65,
        "66":66,
        "67":67,
        "68":68,
        "69":69,
        "70":70,
        "71":71,
        "72":72,
        "73":73,
        "74":74,
        "75":75,
        "76":76,
        "77":77,
        "78":78,
        "79":79,
        "80":80,
        "81":81,
        "82":82,
        "83":83,
        "84":84,
        "85":85,
        "86":86,
        "87":87,
        "88":88,
        "89":89,
        "90":90,
        "91":91,
        "92":92,
        "93":93,
        "94":94,
        "95":95,
        "96":96,
        "97":97,
        "98":98,
        "99":99,
        "100":100,
        "101":101,
        "102":102,
        "103":103,
        "104":104,
        "105":105,
        "106":106,
        "107":107,
        "108":108,
        "109":109,
        "110":110,
        "111":111,
        "112":112,
        "113":113,
        "114":114,
        "115":115,
        "116":116,
        "117":117,
        "118":118,
        "119":119,
        "120":120,
        "121":121,
        "122":122,
        "123":123,
        "124":124,
        "125":125,
        "126":126,
        "127":127,
        "128":128
    },
    "FileName":{
        "0":"arcade-get.txt",
        "1":"arcade-get.txt",
        "2":"arcade-get.txt",
        "3":"arcade-get.txt",
        "4":"arcade-get.txt",
        "5":"atm.txt",
        "6":"atm.txt",
        "7":"bank.txt",
        "8":"bank.txt",
        "9":"baseball.txt",
        "10":"baseball.txt",
        "11":"baseball.txt",
        "12":"baseball.txt",
        "13":"battle-1.txt",
        "14":"battle-1.txt",
        "15":"battle-1.txt",
        "16":"battle-1.txt",
        "17":"battle-1.txt",
        "18":"battle-1.txt",
        "19":"battle-2.txt",
        "20":"battle-2.txt",
        "21":"battle-2.txt",
        "22":"battle-3.txt",
        "23":"battle-3.txt",
        "24":"battle-3.txt",
        "25":"battle-4.txt",
        "26":"battle-4.txt",
        "27":"battle-5.txt",
        "28":"battle-5.txt",
        "29":"battle-5.txt",
        "30":"bonus-deadlock.txt",
        "31":"bonus-deadlock.txt",
        "32":"bonus-deadlock.txt",
        "33":"bonus-ghast.txt",
        "34":"bonus-ghast.txt",
        "35":"bonus-ghast.txt",
        "36":"bonus-hydro.txt",
        "37":"bonus-hydro.txt",
        "38":"bonus-moss.txt",
        "39":"bonus-moss.txt",
        "40":"bonus-moss.txt",
        "41":"bonus-mutex.txt",
        "42":"bonus-mutex.txt",
        "43":"bonus-mutex.txt",
        "44":"bonus-nth.txt",
        "45":"bonus-nth.txt",
        "46":"bonus-nth.txt",
        "47":"bonus-plastered.txt",
        "48":"bonus-plastered.txt",
        "49":"bonus-plastered.txt",
        "50":"bonus-selenium.txt",
        "51":"bonus-selenium.txt",
        "52":"bonus-selenium.txt",
        "53":"bonus-selenium.txt",
        "54":"bonus-x10.txt",
        "55":"bonus-x10.txt",
        "56":"bonus-x10.txt",
        "57":"copy-shop.txt",
        "58":"copy-shop.txt",
        "59":"copy-shop.txt",
        "60":"credit-card.txt",
        "61":"credit-card.txt",
        "62":"dna.txt",
        "63":"dna.txt",
        "64":"dna.txt",
        "65":"dna.txt",
        "66":"edge-detection.txt",
        "67":"edge-detection.txt",
        "68":"find-replace.txt",
        "69":"find-replace.txt",
        "70":"find-replace.txt",
        "71":"ghost-network.txt",
        "72":"ghost-network.txt",
        "73":"heartbeat.txt",
        "74":"highway-sign.txt",
        "75":"highway-sign.txt",
        "76":"interface.txt",
        "77":"interface.txt",
        "78":"left-hand.txt",
        "79":"left-hand.txt",
        "80":"library.txt",
        "81":"library.txt",
        "82":"library.txt",
        "83":"library.txt",
        "84":"mmo.txt",
        "85":"mmo.txt",
        "86":"mmo.txt",
        "87":"nerve-bridge.txt",
        "88":"nerve-bridge.txt",
        "89":"nerve-bridge.txt",
        "90":"nerve-bridge.txt",
        "91":"pagers.txt",
        "92":"pagers.txt",
        "93":"peanut-blast.txt",
        "94":"peanut-blast.txt",
        "95":"pizza-delivery.txt",
        "96":"pizza-delivery.txt",
        "97":"power-grid.txt",
        "98":"power-grid.txt",
        "99":"radio-station.txt",
        "100":"radio-station.txt",
        "101":"radio-station.txt",
        "102":"restaurant.txt",
        "103":"restaurant.txt",
        "104":"sandbox-get.txt",
        "105":"satellite.txt",
        "106":"satellite.txt",
        "107":"satellite.txt",
        "108":"satellite.txt",
        "109":"secure-enclave.txt",
        "110":"secure-enclave.txt",
        "111":"snaxnet.txt",
        "112":"snaxnet.txt",
        "113":"solitaire-get.txt",
        "114":"solitaire-get.txt",
        "115":"tutorial-1.txt",
        "116":"tutorial-1.txt",
        "117":"tutorial-1.txt",
        "118":"tutorial-2.txt",
        "119":"tutorial-2.txt",
        "120":"tutorial-3.txt",
        "121":"tutorial-4.txt",
        "122":"workhouse-2.txt",
        "123":"workhouse-2.txt",
        "124":"workhouse-2.txt",
        "125":"workhouse-2.txt",
        "126":"worm.txt",
        "127":"worm.txt",
        "128":"worm.txt"
    },
    "English":{
        "0":"Modify your WonderDisc, which normally only plays SSEA region games, to play games from any region.",
        "1":null,
        "2":"The SSEA region code is available in file 300.",
        "3":"It is not necessary to leave no trace. Your EXAs should be written to operate indefinitely.",
        "4":"For more information see \"Hardware Hacks: Sawayama WonderDisc\" in the second issue of the zine.",
        "5":"Dispense all available cash from all connected ATMs.",
        "6":"For more information see \"Network Exploration: Equity First Bank\" in the first issue of the zine.",
        "7":"Move EMBER-2's new account (file 300) into *checking*. Then iterate over the checking accounts listed in the directory (file 199) and, in that order, transfer $1.00 from each target account to EMBER-2's account. Finally, add the file ID of EMBER-2's account file to the end of the directory.",
        "8":"The keywords ‗CREDIT‗ and ‗DEBIT‗ are available in file 301.",
        "9":"The hosts *active* and *penalty* contain files that correspond to extreme baseball players (files 200-299), along with a directory file that contains a list of those files' IDs (file 199). Each player file contains their name and the following statistics in this order: BA, ZA, APB, WRT, OI, OD, PC, and PS.",
        "10":"Create a file in your host with the name of the player with the highest score using EMBER-2's algorithm:",
        "11":"SCORE = (BA + ZA + APB) \/ 3 + ( WRT \\* OI ) \/ OD + (PC - PS) \\* 20",
        "12":"Players in the *penalty* host should be ignored, as they are currently banned from the game.",
        "13":"To win this battle you must make your movies play for longer than your opponent's. A movie will play when that movie's file is the only movie file sitting in a *channel* host.",
        "14":"Gain one point every cycle for each of your movies that is playing (files 210 and 211).",
        "15":"Lose one point every cycle that a movie file that isn't yours (files 230, 231, and 265) is held by an EXA you control or is sitting in your host.",
        "16":"Lose one point every time one of your EXAs executes a KILL instruction.",
        "17":"Note that you may only battle your Steam friends after beating the NPC opponent. To view the list of possible opponents, click the \"SELECT OPPONENT\" button above.",
        "18":"For more information see \"Hacker Battle Domination\" in the second issue of the zine.",
        "19":"To win this battle you must control a majority of the hosts for as long as possible.",
        "20":"To take control of a host, write any value to its #CTRL register. Reading from a #CTRL register will tell if you (1) or your opponent (-1) controls the host.",
        "21":"Gain one point every cycle you control more hosts than your opponent.",
        "22":"To win this battle you must grab files as they spawn in the central hosts and bring them back to your host.",
        "23":"Reading the #FILE register will tell you the ID of the most recently created file currently in that host.",
        "24":"Gain one point for every file you bring back to your host.",
        "25":"To win this battle you must fill the network's hosts with as many of your EXAs as you can. Note that each pair of test runs has its own unique network layout, with bi-directional links between hosts that use the prime numbers between 2 and 13 as link IDs (2, 3, 5, 7, 11, and 13).",
        "26":"Gain one point for every EXA you control in the network at the end of the battle.",
        "27":"To win this battle you must occupy a majority of the hosts for as long as possible. You occupy a host if you have more EXAs in it than your opponent.",
        "28":"Gain one point every cycle you occupy more hosts than your opponent.",
        "29":"Writing any value to the #NUKE register will destroy all EXAs in that host, including the EXA that triggered it.",
        "30":"Each host in the network corresponds to a country and contains a list of tickets for flights (file 200) departing airports in that country, bound for airports either also in that country or in a connected country. Each ticket has the following values: ticket ID, departure airport, departure time, arrival airport, and arrival time.",
        "31":"Book the sequence of flights in deadlock's itinerary (file 300) by deleting each ticket from its file in the network and adding the ticket ID to file 301, choosing the first valid flight that departs after the preceding flight arrives.",
        "32":"Note that deadlock's itinerary will always begin in the USA, and that flight times may be compared with TEST.",
        "33":"Each host contains two files: a list of accounts and a list of transactions. Although the entries in these files vary, the first value of each entry is a unique identifier that connects an account to one or more transactions.",
        "34":"Determine the amount of back-pay owed to Ghast and Moss by subtracting the amount that they were paid (file 221) from the amount that they were owed (file 231). Then add their shell company (file 300) to the list of accounts payable (file 220) and issue a single payment to it for the total amout owed (file 221).",
        "35":"Note that all monetary amounts are represented as two values: dollars, then cents.",
        "36":"Find the unredacted version of the ‗PROJECT OGRE‗ report (file 300), make a copy of it, and bring the copy back to your host. The target file will be behind one or more locks, which each require a three-digit code.",
        "37":"Since this task takes place inside a network run by the military it includes additional security features not found in other networks. You may not have more than one EXA in the network at a time, and you may not use the M register to communicate between an EXA in the network and an EXA in your host.",
        "38":"Packetize and transmit the target data (file 301) to the *internet* so that it is uploaded to a warez site (file 300).",
        "39":"A packet is a file that consists of the source IP address (from the #ADDR register), the destination IP address (from the DNS cache, file 201), the checksum of the packet's data, and between 1 and 30 data values. The target data should be split into multiple packets so that no packet except for the last contains fewer than 30 data values.",
        "40":"To calculate a packet's checksum, add the data values together considering each digit separately, wrapping back to 0 when a digit's sum reaches 10. Then flip the sign. For example, the checksum of 3097, 1047, and 2501 is -6535.",
        "41":"Each host contains an item listing (file 200) that lists all of the items in that location (ID, type, and state).",
        "42":"First, locate mutex8021's hideout by finding the ‗TALISMAN‗ (file 300). Then find the ‗MAP‗ in the hideout and use it to locate the target host: the secret vampire lair. Next, travel to the target host, disconnect the vampire players by terminating their EXAs, set the ‗DOOR‗ to be ‗UNLOCKED‗, and copy the ‗SAFE‗ combination to the ‗CLOCK‗ so that mutex8021 can read it and empty the safe.",
        "43":"Note that the door to mutex8021's hideout will always be ‗UNLOCKED‗.",
        "44":"There is a list of appointments (file 200) in *storage* that contains an appointment for NthDimension (file 300) to take his driving test. Remove the appointment from the list of appointments, change the date to today's date (#DATE register), and insert it between today's appointments and tomorrow's appointments.",
        "45":"To gain access to the *storage* host you will need to unlock it by writing the lowest ticket number to the #NEXT register. Each EXA in *public* is holding a ticket; terminate them all to find the ticket of the next EXA to be served.",
        "46":"Note that writing an incorrect ticket number to the #NEXT register will fail the _leave no trace_ requirement.",
        "47":"File 300 contains a phone number where one to three of the digits have been replaced with a placeholder (‗X‗). Using your modem, dial all possible phone numbers that could be generated by replacing the placeholders with the digits 0 through 9. When you discover a valid phone number that connects to another host, append it to file 301.",
        "48":"Note that the phone numbers must be dialed and appended in a specific order such that a placeholder is only incremented when the placeholder to the right cycles through all possible values from 0 to 9 and is reset to 0.",
        "49":"For more information see \"Hacker Skills: Modem Control at the Direct Level\" in the second issue of the zine.",
        "50":"Replace ‗ENGLISH‗ with ‗AP ENGLISH‗ (file 300) in selenium\\_wolf's child's class schedule (file 235).",
        "51":"Because those two classes are most likely not offered at the same time, you may need to rearrange the rest of their schedule to make it fit. Modify the schedule so that they are taking the same classes but at different times when necessary. A full list of classes offered is available in file 200.",
        "52":"Note that there will only be one valid schedule.",
        "53":"Also note that ‗AP ENGLISH‗ will only be offered once and each other class will be offered no more than twice.",
        "54":"The data on this drive array is duplicated across three drives for redundancy, with a file name index stored in the *controller* (file 200). Unfortunately, the drive array is failing.",
        "55":"For each file stored in the drive array, create a file in your host that contains the file name and data. Some values are corrupted and will read as a keyword (‗FAIL‗) instead of a number. You will need to read these values from a different drive that is not corrupted.",
        "56":"Note that some links may be unreliable as a result of the drive array's impending failure.",
        "57":"Erase Ghast's debt to the copy shop by zeroing out his balance in the customer database (file 200) and appending a payment to the payment log (file 201) with today's date and the exact amount of his prior balance.",
        "58":"Ghast's customer ID is available in file 300.",
        "59":"For more information see \"Network Exploration: Digicash Point-of-Sale Systems\" in the first issue of the zine.",
        "60":"Create a file in your host containing the contiguous 16-value sequence from the garbage file (file 199) that is a valid credit card number. There will be exactly one such sequence.",
        "61":"For more information see \"How to Validate Credit Card Numbers\" in the second issue of the zine.",
        "62":"Overwrite the genetic sequence of ‗SEN WALKER CAINE JR‗ with the genetic sequence of ‗PRES WALKER CAINE‗ so that it looks like the younger politician is actually a clone of the older politician.",
        "63":"The names of these two politicians are available in file 300.",
        "64":"Note that you may need to overwrite a data chunk with another data chunk from the same file.",
        "65":"For more information see \"Accessing Data in Legacy Storage Systems\" in the first issue of the zine.",
        "66":"Read a value from each of the optic nerves present and write the correct value to the nerve that runs deeper into your visual cortex (V-CTX). To determine the value that should be written, count the number of values read that are greater than -55, multiply that count by 5, and then subtract 75. Repeat _ad infinitum_.",
        "67":"For more information see \"Debugging the Phage\" in the first issue of the zine.",
        "68":"Find and replace the keywords in the target message (file 212) as directed by EMBER-2.",
        "69":"A list of keyword pairs indicating which words should be found and what they should be replaced with is available in file 300. For example, the keyword ‗AI‗ should be replaced with the keyword ‗COLLECTIVE‗. Each keyword will only occur once, but may occur in any order.",
        "70":"Also, move file 200 to the *outbox*.",
        "71":"Find file 276 in the network and bring it back to your host.",
        "72":"Note that an EXA cannot grab a file that is being held by another EXA.",
        "73":"Read a value from the nerve connected to your central nervous system (CNS) and make your heart beat by writing a sequence of values to your sinoatrial (SA-N) and atrioventricular (AV-N) nodes as indicated in the HDI-10 I\/O log when holding the \"SHOW GOAL\" button. The length of each sequence of values should be equal to the value from the CNS divided by -10. Repeat _ad infinitum_.",
        "74":"Write EMBER-2's message (file 300) to the highway sign. The file contains one character value for each position on the sign from left to right, top to bottom.",
        "75":"For more information see \"Hardware Hacks: Electronic Highway Signs\" in the first issue of the zine.",
        "76":"Create a file in your host containing the hostname and hardware register value of each neuron exactly once, sorted as pairs from lowest to highest hostname.",
        "77":"Note that each test run has its own unique network layout.",
        "78":"There are three nerve signals that need to be relayed: muscle control (M), which runs from your central nervous system (CNS) to your hand (HND), and heat (H) and pressure (P), which run the other direction.",
        "79":"For each signal, read a value from the input nerve and relay it to the output nerve. Repeat _ad infinitum_.",
        "80":"Books are stored in the host corresponding to the first digit of their call number, while a book's file ID is 200 plus the last two digits of the call number. For example, book 512 would be stored in the host *500-599* as file 212.",
        "81":"Duplicate each of the books requested by EMBER-2 and bring them back to your host.",
        "82":"The call numbers for the books EMBER-2 wants are available in file 300.",
        "83":"Note that EMBER-2 will never request more than one book from the same host.",
        "84":"Reset the ownership of all castles and sub-buildings to ‗P00000‗ (file 300), the player ID for unowned buildings.",
        "85":"To ensure that there are no witnesses you must first disconnect all connected players. Terminate every EXA in every host before changing any castle or sub-building files anywhere in the network. If you leave an EXA alive in one host while changing a file in another you will fail the task.",
        "86":"For more information see \"Network Exploration: King's Ransom Online\" in the second issue of the zine.",
        "87":"Read a value from the nerve connected to your central nervous system (CNS) and relay it to the nerve connected to your arm (ARM), clamping the value so that it never goes below -120 or above 50. Repeat _ad infinitum_.",
        "88":"Since this task takes place inside a network you control— that is, your own body— it is not necessary to leave no trace. Your EXAs should be written to operate indefinitely.",
        "89":"Note that #NERV is a _hardware register_, not a file. You can use it directly in your code like any other register.",
        "90":"For more information about the phage see \"Debugging the Phage\" in the first issue of the zine.",
        "91":"Connect to each pager and copy EMBER-2's message (file 300) to the screen (#DATA). Then activate all of the pagers at exactly the same time by writing a value to each #PAGE register in the same cycle.",
        "92":"A list of phone numbers for the pagers is available in file 301.",
        "93":"Remove the keyword ‗PEANUTS‗ (file 300) from the Peanut Blast recipe (file 237).",
        "94":"Note that the target keyword will appear in a different position in each of the 100 test runs. To view and debug each of the different test runs, click the arrow buttons next to the \"TEST RUN\" display above.",
        "95":"Append your order (file 300) to the end of the order list (file 200).",
        "96":"Note that all orders, including yours, will consist of exactly five keywords.",
        "97":"Locate the two hosts with the specified hostnames (file 300), which correspond to the target power grid substations. When you've found them, cut the power by writing a value of 0 to #POWR.",
        "98":"For more information see \"Network Exploration: Geographic Information Systems\" in the second issue of the zine.",
        "99":"Connect to each radio station and replace every song in the playlist (file 200) with ‗CAN'T (NOT) GET OVER YOU‗ by ‗ME2U‗ (file 300). Each song in a playlist consists of two keywords: the song name and the artist name.",
        "100":"A list of phone numbers for the radio stations is available in file 301.",
        "101":"Note that EXAs in global mode can only communicate if there is a path of links connecting them.",
        "102":"Each host contains a list of restaurants and their ratings, from one to five stars (file 200). Locate the entry that corresponds to the Last Stop on Eddy Street and change its rating from one to five stars.",
        "103":"The name of the target restaurant and its location within the GIS grid is available in file 300. The first coordinate is the number of times to move east, while the second coordinate is the number of times to move north (positive) or south (negative).",
        "104":"There is an unknown three-digit code (such as 4-7-3) that, when entered one digit at a time into #PASS, will unlock the link between *debug* and *secret*. Find the three-digit code and create a file in your host that contains the code as a sequence of three values, followed by the development kit's RDK ID.",
        "105":"Align the satellite dish with the target satellite by setting the azimuth, elevation, and frequency. Then transmit the data from EMBER-2's video (file 301) after encrypting it using the TV station's encryption key (file 199).",
        "106":"The azimuth, elevation, and frequency of the target satellite are available in file 300.",
        "107":"Note that you must align the satellite dish before transmitting any data.",
        "108":"For more information see \"Look to the Stars with Satellite Uplink Systems\" in the second issue of the zine.",
        "109":"Terminate all other EXAs and bring any files they were holding back to your host. Only EXAs in the central host will be holding files, and their file IDs will always be between 200 and 299, inclusive.",
        "110":"Note that some links may become non-traversable as a result of your actions.",
        "111":"An array of five Zippe-type gas centrifuges, ZGC0 through ZGC4, are connected in a cascade configuration.",
        "112":"Read each of the #ZGCX registers and determine which centrifuge currently has the highest pressure. Then disable that centrifuge's regulator by writing a value of 0 to its #POWR register. Repeat this process until all five regulators have been disabled.",
        "113":"Locate the specified host (either *tape-1*, *tape-2*, or *tape-3*), and then locate the specified entry (‗ПАСЬЯНС‗) in the tape backup file in that host (file 200). Create a file in your host containing the entry's data.",
        "114":"The names of the target host and entry are available in file 300.",
        "115":"Move file 200 to the *outbox*.",
        "116":"This task, like most tasks, requires you to _leave no trace_. You must terminate all of your EXAs, not leave any extraneous files in the network, and not make any changes to the network other than those specified by the task's requirements.",
        "117":"For help completing this task see \"Ghast Walks U Thru It\" in the first issue of the zine.",
        "118":"Add the first two values of file 200, multiply the result by the third value, and then subtract the fourth value. Append the result to the end of the file and then move it to the *outbox*.",
        "119":"You can press the \"SHOW GOAL\" button (or F1) at any time to see a preview of the completed task.",
        "120":"File 199 contains exactly two values: a keyword and a number. Create a new file in the *outbox* and copy those two values to it, swapping their order so that the number is first. When you are finished, delete file 199.",
        "121":"File 200 contains exactly one number, N. Create a new file in the *outbox* containing the numbers N through 0 in decreasing order. When you are finished, delete file 200.",
        "122":"Locate EMBER-2's user file in the *users* host and overwrite it so that the sum of the values is the same but no individual value exceeds $75. All values, except for the last, must be the maximum value ($75). You will need to add additional values to accomplish this.",
        "123":"EMBER-2's username is available in file 300.",
        "124":"Note that the sum of the values in EMBER-2's account will always be less than $10,000.",
        "125":"For more information see \"Network Exploration: Workhouse\" in the first issue of the zine.",
        "126":"Using your modem, connect to each dataphone so that EMBER-2 will have a list of valid phone numbers.",
        "127":"Each dataphone contains a list of the owner's contacts (file 200). The phone number of one of these dataphones is in your host (file 300), while the rest are in the contact list of another dataphone.",
        "128":"Note that each dataphone (aside from the first) will appear in exactly one other dataphone's contact list, in such a way that you can find them all without getting stuck in a loop."
    },
    "German":{
        "0":null,
        "1":null,
        "2":null,
        "3":null,
        "4":null,
        "5":null,
        "6":null,
        "7":null,
        "8":null,
        "9":null,
        "10":null,
        "11":null,
        "12":null,
        "13":null,
        "14":null,
        "15":null,
        "16":null,
        "17":null,
        "18":null,
        "19":null,
        "20":null,
        "21":null,
        "22":null,
        "23":null,
        "24":null,
        "25":null,
        "26":null,
        "27":null,
        "28":null,
        "29":null,
        "30":null,
        "31":null,
        "32":null,
        "33":null,
        "34":null,
        "35":null,
        "36":null,
        "37":null,
        "38":null,
        "39":null,
        "40":null,
        "41":null,
        "42":null,
        "43":null,
        "44":null,
        "45":null,
        "46":null,
        "47":null,
        "48":null,
        "49":null,
        "50":null,
        "51":null,
        "52":null,
        "53":null,
        "54":null,
        "55":null,
        "56":null,
        "57":null,
        "58":null,
        "59":null,
        "60":null,
        "61":null,
        "62":null,
        "63":null,
        "64":null,
        "65":null,
        "66":null,
        "67":null,
        "68":null,
        "69":null,
        "70":null,
        "71":null,
        "72":null,
        "73":null,
        "74":null,
        "75":null,
        "76":null,
        "77":null,
        "78":null,
        "79":null,
        "80":null,
        "81":null,
        "82":null,
        "83":null,
        "84":null,
        "85":null,
        "86":null,
        "87":null,
        "88":null,
        "89":null,
        "90":null,
        "91":null,
        "92":null,
        "93":null,
        "94":null,
        "95":null,
        "96":null,
        "97":null,
        "98":null,
        "99":null,
        "100":null,
        "101":null,
        "102":null,
        "103":null,
        "104":null,
        "105":null,
        "106":null,
        "107":null,
        "108":null,
        "109":null,
        "110":null,
        "111":null,
        "112":null,
        "113":null,
        "114":null,
        "115":null,
        "116":null,
        "117":null,
        "118":null,
        "119":null,
        "120":null,
        "121":null,
        "122":null,
        "123":null,
        "124":null,
        "125":null,
        "126":null,
        "127":null,
        "128":null
    },
    "French":{
        "0":null,
        "1":null,
        "2":null,
        "3":null,
        "4":null,
        "5":null,
        "6":null,
        "7":null,
        "8":null,
        "9":null,
        "10":null,
        "11":null,
        "12":null,
        "13":null,
        "14":null,
        "15":null,
        "16":null,
        "17":null,
        "18":null,
        "19":null,
        "20":null,
        "21":null,
        "22":null,
        "23":null,
        "24":null,
        "25":null,
        "26":null,
        "27":null,
        "28":null,
        "29":null,
        "30":null,
        "31":null,
        "32":null,
        "33":null,
        "34":null,
        "35":null,
        "36":null,
        "37":null,
        "38":null,
        "39":null,
        "40":null,
        "41":null,
        "42":null,
        "43":null,
        "44":null,
        "45":null,
        "46":null,
        "47":null,
        "48":null,
        "49":null,
        "50":null,
        "51":null,
        "52":null,
        "53":null,
        "54":null,
        "55":null,
        "56":null,
        "57":null,
        "58":null,
        "59":null,
        "60":null,
        "61":null,
        "62":null,
        "63":null,
        "64":null,
        "65":null,
        "66":null,
        "67":null,
        "68":null,
        "69":null,
        "70":null,
        "71":null,
        "72":null,
        "73":null,
        "74":null,
        "75":null,
        "76":null,
        "77":null,
        "78":null,
        "79":null,
        "80":null,
        "81":null,
        "82":null,
        "83":null,
        "84":null,
        "85":null,
        "86":null,
        "87":null,
        "88":null,
        "89":null,
        "90":null,
        "91":null,
        "92":null,
        "93":null,
        "94":null,
        "95":null,
        "96":null,
        "97":null,
        "98":null,
        "99":null,
        "100":null,
        "101":null,
        "102":null,
        "103":null,
        "104":null,
        "105":null,
        "106":null,
        "107":null,
        "108":null,
        "109":null,
        "110":null,
        "111":null,
        "112":null,
        "113":null,
        "114":null,
        "115":null,
        "116":null,
        "117":null,
        "118":null,
        "119":null,
        "120":null,
        "121":null,
        "122":null,
        "123":null,
        "124":null,
        "125":null,
        "126":null,
        "127":null,
        "128":null
    },
    "Russian":{
        "0":null,
        "1":null,
        "2":null,
        "3":null,
        "4":null,
        "5":null,
        "6":null,
        "7":null,
        "8":null,
        "9":null,
        "10":null,
        "11":null,
        "12":null,
        "13":null,
        "14":null,
        "15":null,
        "16":null,
        "17":null,
        "18":null,
        "19":null,
        "20":null,
        "21":null,
        "22":null,
        "23":null,
        "24":null,
        "25":null,
        "26":null,
        "27":null,
        "28":null,
        "29":null,
        "30":null,
        "31":null,
        "32":null,
        "33":null,
        "34":null,
        "35":null,
        "36":null,
        "37":null,
        "38":null,
        "39":null,
        "40":null,
        "41":null,
        "42":null,
        "43":null,
        "44":null,
        "45":null,
        "46":null,
        "47":null,
        "48":null,
        "49":null,
        "50":null,
        "51":null,
        "52":null,
        "53":null,
        "54":null,
        "55":null,
        "56":null,
        "57":null,
        "58":null,
        "59":null,
        "60":null,
        "61":null,
        "62":null,
        "63":null,
        "64":null,
        "65":null,
        "66":null,
        "67":null,
        "68":null,
        "69":null,
        "70":null,
        "71":null,
        "72":null,
        "73":null,
        "74":null,
        "75":null,
        "76":null,
        "77":null,
        "78":null,
        "79":null,
        "80":null,
        "81":null,
        "82":null,
        "83":null,
        "84":null,
        "85":null,
        "86":null,
        "87":null,
        "88":null,
        "89":null,
        "90":null,
        "91":null,
        "92":null,
        "93":null,
        "94":null,
        "95":null,
        "96":null,
        "97":null,
        "98":null,
        "99":null,
        "100":null,
        "101":null,
        "102":null,
        "103":null,
        "104":null,
        "105":null,
        "106":null,
        "107":null,
        "108":null,
        "109":null,
        "110":null,
        "111":null,
        "112":null,
        "113":null,
        "114":null,
        "115":null,
        "116":null,
        "117":null,
        "118":null,
        "119":null,
        "120":null,
        "121":null,
        "122":null,
        "123":null,
        "124":null,
        "125":null,
        "126":null,
        "127":null,
        "128":null
    },
    "Chinese":{
        "0":null,
        "1":null,
        "2":null,
        "3":null,
        "4":null,
        "5":null,
        "6":null,
        "7":null,
        "8":null,
        "9":null,
        "10":null,
        "11":null,
        "12":null,
        "13":null,
        "14":null,
        "15":null,
        "16":null,
        "17":null,
        "18":null,
        "19":null,
        "20":null,
        "21":null,
        "22":null,
        "23":null,
        "24":null,
        "25":null,
        "26":null,
        "27":null,
        "28":null,
        "29":null,
        "30":null,
        "31":null,
        "32":null,
        "33":null,
        "34":null,
        "35":null,
        "36":null,
        "37":null,
        "38":null,
        "39":null,
        "40":null,
        "41":null,
        "42":null,
        "43":null,
        "44":null,
        "45":null,
        "46":null,
        "47":null,
        "48":null,
        "49":null,
        "50":null,
        "51":null,
        "52":null,
        "53":null,
        "54":null,
        "55":null,
        "56":null,
        "57":null,
        "58":null,
        "59":null,
        "60":null,
        "61":null,
        "62":null,
        "63":null,
        "64":null,
        "65":null,
        "66":null,
        "67":null,
        "68":null,
        "69":null,
        "70":null,
        "71":null,
        "72":null,
        "73":null,
        "74":null,
        "75":null,
        "76":null,
        "77":null,
        "78":null,
        "79":null,
        "80":null,
        "81":null,
        "82":null,
        "83":null,
        "84":null,
        "85":null,
        "86":null,
        "87":null,
        "88":null,
        "89":null,
        "90":null,
        "91":null,
        "92":null,
        "93":null,
        "94":null,
        "95":null,
        "96":null,
        "97":null,
        "98":null,
        "99":null,
        "100":null,
        "101":null,
        "102":null,
        "103":null,
        "104":null,
        "105":null,
        "106":null,
        "107":null,
        "108":null,
        "109":null,
        "110":null,
        "111":null,
        "112":null,
        "113":null,
        "114":null,
        "115":"将文件200移动到*发件箱*。",
        "116":null,
        "117":null,
        "118":null,
        "119":null,
        "120":null,
        "121":null,
        "122":null,
        "123":null,
        "124":null,
        "125":null,
        "126":null,
        "127":null,
        "128":null
    },
    "Japanese":{
        "0":null,
        "1":null,
        "2":null,
        "3":null,
        "4":null,
        "5":null,
        "6":null,
        "7":null,
        "8":null,
        "9":null,
        "10":null,
        "11":null,
        "12":null,
        "13":null,
        "14":null,
        "15":null,
        "16":null,
        "17":null,
        "18":null,
        "19":null,
        "20":null,
        "21":null,
        "22":null,
        "23":null,
        "24":null,
        "25":null,
        "26":null,
        "27":null,
        "28":null,
        "29":null,
        "30":null,
        "31":null,
        "32":null,
        "33":null,
        "34":null,
        "35":null,
        "36":null,
        "37":null,
        "38":null,
        "39":null,
        "40":null,
        "41":null,
        "42":null,
        "43":null,
        "44":null,
        "45":null,
        "46":null,
        "47":null,
        "48":null,
        "49":null,
        "50":null,
        "51":null,
        "52":null,
        "53":null,
        "54":null,
        "55":null,
        "56":null,
        "57":null,
        "58":null,
        "59":null,
        "60":null,
        "61":null,
        "62":null,
        "63":null,
        "64":null,
        "65":null,
        "66":null,
        "67":null,
        "68":null,
        "69":null,
        "70":null,
        "71":null,
        "72":null,
        "73":null,
        "74":null,
        "75":null,
        "76":null,
        "77":null,
        "78":null,
        "79":null,
        "80":null,
        "81":null,
        "82":null,
        "83":null,
        "84":null,
        "85":null,
        "86":null,
        "87":null,
        "88":null,
        "89":null,
        "90":null,
        "91":null,
        "92":null,
        "93":null,
        "94":null,
        "95":null,
        "96":null,
        "97":null,
        "98":null,
        "99":null,
        "100":null,
        "101":null,
        "102":null,
        "103":null,
        "104":null,
        "105":null,
        "106":null,
        "107":null,
        "108":null,
        "109":null,
        "110":null,
        "111":null,
        "112":null,
        "113":null,
        "114":null,
        "115":null,
        "116":null,
        "117":null,
        "118":null,
        "119":null,
        "120":null,
        "121":null,
        "122":null,
        "123":null,
        "124":null,
        "125":null,
        "126":null,
        "127":null,
        "128":null
    }
}